EWSEditor/EwsPostExamples/GetUserSettings - for autodiscover.svc.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:a="http://schemas.microsoft.com/exchange/2010/Autodiscover" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <a:RequestedServerVersion>Exchange2013</a:RequestedServerVersion>
    <wsa:Action>http://schemas.microsoft.com/exchange/2010/Autodiscover/Autodiscover/GetUserSettings</wsa:Action>
    <wsa:To>https://mail.microsoft.com/autodiscover/autodiscover.svc</wsa:To>
  </soap:Header>
  <soap:Body>
    <a:GetUserSettingsRequestMessage xmlns:a="http://schemas.microsoft.com/exchange/2010/Autodiscover">
      <a:Request>
        <a:Users>
          <a:User>
            <a:Mailbox>testuser@contoso.com</a:Mailbox>
          </a:User>
        </a:Users>
        <a:RequestedSettings>
          <a:Setting>UserDisplayName</a:Setting>
          <a:Setting>UserDN</a:Setting>
          <a:Setting>UserDeploymentId</a:Setting>
          <a:Setting>InternalMailboxServer</a:Setting>
          <a:Setting>InternalRpcClientServer</a:Setting>
          <a:Setting>InternalMailboxServerDN</a:Setting>
          <a:Setting>InternalEcpUrl</a:Setting>
          <a:Setting>InternalEcpVoicemailUrl</a:Setting>
          <a:Setting>InternalEcpEmailSubscriptionsUrl</a:Setting>
          <a:Setting>InternalEcpTextMessagingUrl</a:Setting>
          <a:Setting>InternalEcpDeliveryReportUrl</a:Setting>
          <a:Setting>InternalEcpRetentionPolicyTagsUrl</a:Setting>
          <a:Setting>InternalEcpPublishingUrl</a:Setting>
          <a:Setting>InternalEcpPhotoUrl</a:Setting>
          <a:Setting>InternalEcpConnectUrl</a:Setting>
          <a:Setting>InternalEcpTeamMailboxUrl</a:Setting>
          <a:Setting>InternalEcpTeamMailboxCreatingUrl</a:Setting>
          <a:Setting>InternalEcpTeamMailboxEditingUrl</a:Setting>
          <a:Setting>InternalEcpTeamMailboxHidingUrl</a:Setting>
          <a:Setting>InternalEcpExtensionInstallationUrl</a:Setting>
          <a:Setting>InternalEwsUrl</a:Setting>
          <a:Setting>InternalEmwsUrl</a:Setting>
          <a:Setting>InternalOABUrl</a:Setting>
          <a:Setting>InternalPhotosUrl</a:Setting>
          <a:Setting>InternalUMUrl</a:Setting>
          <a:Setting>InternalWebClientUrls</a:Setting>
          <a:Setting>MailboxDN</a:Setting>
          <a:Setting>PublicFolderServer</a:Setting>
          <a:Setting>ActiveDirectoryServer</a:Setting>
          <a:Setting>ExternalMailboxServer</a:Setting>
          <a:Setting>ExternalMailboxServerRequiresSSL</a:Setting>
          <a:Setting>ExternalMailboxServerAuthenticationMethods</a:Setting>
          <a:Setting>EcpVoicemailUrlFragment</a:Setting>
          <a:Setting>EcpEmailSubscriptionsUrlFragment</a:Setting>
          <a:Setting>EcpTextMessagingUrlFragment</a:Setting>
          <a:Setting>EcpDeliveryReportUrlFragment</a:Setting>
          <a:Setting>EcpRetentionPolicyTagsUrlFragment</a:Setting>
          <a:Setting>EcpPublishingUrlFragment</a:Setting>
          <a:Setting>EcpPhotoUrlFragment</a:Setting>
          <a:Setting>EcpConnectUrlFragment</a:Setting>
          <a:Setting>EcpTeamMailboxUrlFragment</a:Setting>
          <a:Setting>EcpTeamMailboxCreatingUrlFragment</a:Setting>
          <a:Setting>EcpTeamMailboxEditingUrlFragment</a:Setting>
          <a:Setting>EcpExtensionInstallationUrlFragment</a:Setting>
          <a:Setting>ExternalEcpUrl</a:Setting>
          <a:Setting>ExternalEcpVoicemailUrl</a:Setting>
          <a:Setting>ExternalEcpEmailSubscriptionsUrl</a:Setting>
          <a:Setting>ExternalEcpTextMessagingUrl</a:Setting>
          <a:Setting>ExternalEcpDeliveryReportUrl</a:Setting>
          <a:Setting>ExternalEcpRetentionPolicyTagsUrl</a:Setting>
          <a:Setting>ExternalEcpPublishingUrl</a:Setting>
          <a:Setting>ExternalEcpPhotoUrl</a:Setting>
          <a:Setting>ExternalEcpConnectUrl</a:Setting>
          <a:Setting>ExternalEcpTeamMailboxUrl</a:Setting>
          <a:Setting>ExternalEcpTeamMailboxCreatingUrl</a:Setting>
          <a:Setting>ExternalEcpTeamMailboxEditingUrl</a:Setting>
          <a:Setting>ExternalEcpTeamMailboxHidingUrl</a:Setting>
          <a:Setting>ExternalEcpExtensionInstallationUrl</a:Setting>
          <a:Setting>ExternalEwsUrl</a:Setting>
          <a:Setting>ExternalEmwsUrl</a:Setting>
          <a:Setting>ExternalOABUrl</a:Setting>
          <a:Setting>ExternalPhotosUrl</a:Setting>
          <a:Setting>ExternalUMUrl</a:Setting>
          <a:Setting>ExternalWebClientUrls</a:Setting>
          <a:Setting>CrossOrganizationSharingEnabled</a:Setting>
          <a:Setting>AlternateMailboxes</a:Setting>
          <a:Setting>CasVersion</a:Setting>
          <a:Setting>EwsSupportedSchemas</a:Setting>
          <a:Setting>InternalPop3Connections</a:Setting>
          <a:Setting>ExternalPop3Connections</a:Setting>
          <a:Setting>InternalImap4Connections</a:Setting>
          <a:Setting>ExternalImap4Connections</a:Setting>
          <a:Setting>InternalSmtpConnections</a:Setting>
          <a:Setting>ExternalSmtpConnections</a:Setting>
          <a:Setting>InternalServerExclusiveConnect</a:Setting>
          <a:Setting>ExternalEwsVersion</a:Setting>
          <a:Setting>MobileMailboxPolicy</a:Setting>
          <a:Setting>DocumentSharingLocations</a:Setting>
          <a:Setting>UserMSOnline</a:Setting>
          <a:Setting>InternalMailboxServerAuthenticationMethods</a:Setting>
          <a:Setting>MailboxVersion</a:Setting>
          <a:Setting>SPMySiteHostURL</a:Setting>
          <a:Setting>SiteMailboxCreationURL</a:Setting>
          <a:Setting>InternalRpcHttpServer</a:Setting>
          <a:Setting>InternalRpcHttpConnectivityRequiresSsl</a:Setting>
          <a:Setting>InternalRpcHttpAuthenticationMethod</a:Setting>
          <a:Setting>ExternalServerExclusiveConnect</a:Setting>
          <a:Setting>ExchangeRpcUrl</a:Setting>
          <a:Setting>ShowGalAsDefaultView</a:Setting>
          <a:Setting>AutoDiscoverSMTPAddress</a:Setting>
          <a:Setting>InteropExternalEwsUrl</a:Setting>
          <a:Setting>InteropExternalEwsVersion</a:Setting>
          <a:Setting>PublicFolderInformation</a:Setting>
          <a:Setting>RedirectUrl</a:Setting>
          <a:Setting>EwsPartnerUrl</a:Setting>
          <a:Setting>GroupingInformation</a:Setting>
        </a:RequestedSettings>
      </a:Request>
    </a:GetUserSettingsRequestMessage>
  </soap:Body>
</soap:Envelope>


